backend/controllers/PostController.php

    public function actionIndex()
    {
        //每页多少条数据
        $pageSize = 20;
        //总共有多少条数据
        $counts = Articles::find()->count();
        //总共有多少条页数
        $totalPage = ceil($counts / $pageSize);
        $data = Articles::find()->orderBy("id desc")->limit($pageSize)->asArray()->all();
---
SELECT COUNT(*) FROM `articles`
SELECT * FROM `articles` ORDER BY `id` DESC LIMIT 20