common/models/Menu.php

SELECT * FROM `menu` WHERE status = 1
---
    public static function findIdentitys($where)
    {
//        return static::findAll(['status' => $status]);
        $query = new \yii\db\Query();
        $rows = $query->select("*")->from("menu")->where($where)->all();