common/models/UserParticulars.php

    public static function findIdentitys($where)
    {
//        return static::findAll(['status' => $status]);
        $query = new \yii\db\Query();
        $rows = $query->select("*")->from("user as u1")->join('LEFT JOIN','user_particulars as u2','u1.id = u2.user_id')->where($where)->one();
---
SELECT * FROM `user` `u1` LEFT JOIN `user_particulars` `u2` ON u1.id = u2.user_id WHERE u1.status = 10 and u1.id = 1